configuration/src/InformationRegisters/СвязьОбъектовИРолей/СвязьОбъектовИРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьОбъектовИРолей</name>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Используется если свойство РассчитыватьПраво не установлено</comment>
    <type>
      <types>EnumRef.ВидыПравДоступа</types>
    </type>
  </resources>
  <resources>
    <name>ИмяМетода</name>
    <comment>Имя метода для расчета значения права</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяМетодаНастройки</name>
    <comment>Имя метода для применения разрешений</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьПраво</name>
    <comment>Определяет способ расчета права: Истина - право будет расчитано методом из свойства ИмяМетода, Ложь - будет использовано значение по умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Идентификатор объекта метаданных</comment>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <comment>Программная роль или роль конфигурации</comment>
    <type>
      <types>CatalogRef.ПрограммныеРоли</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ВидыПравДоступа/ВидыПравДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПравДоступа</name>
  <enumValues>
    <name>Запрещено</name>
  </enumValues>
  <enumValues>
    <name>Разрешено</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Документ</name>
      <description>Документ</description>
    </items>
    <items>
      <name>Константа</name>
      <description>Константа</description>
    </items>
    <items>
      <name>Обработка</name>
      <description>Обработка</description>
    </items>
    <items>
      <name>ОбщаяКоманда</name>
      <description>ОбщаяКоманда</description>
    </items>
    <items>
      <name>ОбщаяФорма</name>
      <description>ОбщаяФорма</description>
    </items>
    <items>
      <name>Отчет</name>
      <description>Отчет</description>
    </items>
    <items>
      <name>Перечисление</name>
      <description>Перечисление</description>
    </items>
    <items>
      <name>ПланВидовХарактеристик</name>
      <description>ПланВидовХарактеристик</description>
    </items>
    <items>
      <name>ПланОбмена</name>
      <description>ПланОбмена</description>
    </items>
    <items>
      <name>РегистрНакопления</name>
      <description>РегистрНакопления</description>
    </items>
    <items>
      <name>РегистрСведений</name>
      <description>РегистрСведений</description>
    </items>
    <items>
      <name>Справочник</name>
      <description>Справочник</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/InformationRegisters/СвязьОбъектовИРолей/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "РегистрыСведений.СвязьОбъектовИРолей.ПроверитьПредопределенныеНастройки";
	
КонецПроцедуры

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеНастройки() Экспорт                              
	
	ИмяМетода = "БезопасностьПереопределяемый.ПравоНастройкаОграниченногоПросмотра";
	МетодНастройки = "БезопасностьПереопределяемый.ПрименитьПравоНастройкаОграниченногоПросмотра";
	ЗаполнитьНастройку("ОбщаяФорма.НастройкаПравОбъектов", "НастройкаОграниченногоПросмотра", 
		Перечисления.ВидыПравДоступа.Разрешено, ИмяМетода, МетодНастройки);
		
	ИмяМетода = "БезопасностьПереопределяемый.ПравоРазрешитьОткрытиеОграниченныйПросмотр_Заявка";
	ЗаполнитьНастройку("Документ.ЗаявкаНаРазработку.Форма.ФормаДокумента", "ОграниченныйПросмотр", 
		Перечисления.ВидыПравДоступа.Разрешено, ИмяМетода);
		
	ИмяМетода = "БезопасностьПереопределяемый.ПравоРазрешитьОткрытиеОграниченныйПросмотр_Задача";
	ЗаполнитьНастройку("Документ.Задача.Форма.ФормаДокумента", "ОграниченныйПросмотр", 
		Перечисления.ВидыПравДоступа.Разрешено, ИмяМетода); 
		
	ИмяМетода = "БезопасностьПереопределяемый.ПравоОтклоненияЗаявки";
	МетодНастройки = "БезопасностьПереопределяемый.ПрименитьПравоОтклоненияЗаявки";
	ЗаполнитьНастройку("Документ.ЗаявкаНаРазработку.Форма.ФормаДокумента", "ОтклонениеЗаявки", 
		Перечисления.ВидыПравДоступа.Запрещено, ИмяМетода, МетодНастройки);
		
	ИмяМетода = "БезопасностьПереопределяемый.ПравоДелегированияЗаявки";
	МетодНастройки = "БезопасностьПереопределяемый.ПрименитьПравоДелегированияЗаявки";
	ЗаполнитьНастройку("Документ.ЗаявкаНаРазработку.Форма.ФормаДокумента", "ДелегированиеЗаявки", 
		Перечисления.ВидыПравДоступа.Запрещено, ИмяМетода, МетодНастройки);	
		
	ИмяМетода = "БезопасностьПереопределяемый.ПравоУстановитьОграниченныйПросмотр";
	МетодНастройки = "БезопасностьПереопределяемый.ПрименитьПравоУстановкиОграниченногоПросмотра";
	ЗаполнитьНастройку("Документ.ЗаявкаНаРазработку.Форма.ФормаДокумента", "УстановитьОграниченныйПросмотр", 
		Перечисления.ВидыПравДоступа.Запрещено, ИмяМетода, МетодНастройки);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура ЗаполнитьНастройку(Объект, Роль, ЗначениеПоУмолчанию, ИмяМетода, ИмяМетодаНастройки = "", РассчитыватьПраво = Истина);
	
	ОбъектМетаданных = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмяФормы", Объект); 
	
	Если НЕ ЗначениеЗаполнено(ОбъектМетаданных) Тогда  
		Сообщение = НСтр("ru = 'Элемент ИдентификаторыОбъектовМетаданных ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", Объект);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
	Попытка
		ПрограммнаяРоль = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПрограммныеРоли." + Роль);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ПрограммныеРоли." + Роль);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(ОбъектМетаданных);
	Набор.Отбор.Роль.Установить(ПрограммнаяРоль);
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда	
		Запись = Набор.Добавить();
		Запись.Объект = ОбъектМетаданных;
		Запись.Роль = ПрограммнаяРоль;
		Запись.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
		Запись.ИмяМетода = ИмяМетода;
		Запись.ИмяМетодаНастройки = ИмяМетодаНастройки;
		Запись.РассчитыватьПраво = РассчитыватьПраво;      
		Запись.Использование = Истина;
		Набор.Записать();               
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
